<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python56_reshape.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

# DataFrame의 모양(shape)을 변경

* Wide -> Long
* Long -> Wide

* stack(): Wide -> Long, columns -> MultiIndex
* unstack(): Long -> Wide, MultiIndex -> columns

In [4]:
df = pd.DataFrame(data=np.arange(6).reshape((2, 3)),
                  index=['A', 'B'],
                  columns=['a', 'b', 'c'])
df

   a  b  c
A  0  1  2
B  3  4  5

In [5]:
df_stacked = df.stack()
df_stacked

A  a    0
   b    1
   c    2
B  a    3
   b    4
   c    5
dtype: int64

In [6]:
df_unstacked = df_stacked.unstack()
df_unstacked
# unstack() 함수의 기본 동작은 가장 마지막 level의 인덱스들을 컬럼으로 변환.

   a  b  c
A  0  1  2
B  3  4  5

In [7]:
df_unstacked2 = df_stacked.unstack(level=0)
df_unstacked2

   A  B
a  0  3
b  1  4
c  2  5

* pivot(): Long -> Wide, row -> column
* melt(): Wide -> Long, column -> row

In [11]:
df = pd.DataFrame(data={'A': ['one', 'one', 'one', 'two', 'two', 'two'],
                        'B': ['a', 'b', 'c', 'a', 'b', 'c'],
                        'C': [1, 2, 3, 4, 5, 6],
                        'D': [2, 4, 8, 1, 3, 5]})
df

     A  B  C  D
0  one  a  1  2
1  one  b  2  4
2  one  c  3  8
3  two  a  4  1
4  two  b  5  3
5  two  c  6  5

In [12]:
pivot1 = df.pivot(index='A', columns='B', values='C')
pivot1

B    a  b  c
A
one  1  2  3
two  4  5  6

In [13]:
df.pivot(index='A', columns='B', values='D')

B    a  b  c
A
one  2  4  8
two  1  3  5

In [14]:
df.pivot(index='B', columns='A', values='C')

A  one  two
B
a    1    4
b    2    5
c    3    6

In [15]:
df

     A  B  C  D
0  one  a  1  2
1  one  b  2  4
2  one  c  3  8
3  two  a  4  1
4  two  b  5  3
5  two  c  6  5

In [16]:
df.pivot(index='A', columns='B', values=['C', 'D'])

     C        D
B    a  b  c  a  b  c
A
one  1  2  3  2  4  8
two  4  5  6  1  3  5

In [18]:
df = pd.DataFrame(data={'key1':['KO', 'KO', 'KO', 'US', 'US', 'US'],
                        'key2':['a1', 'a1', 'a2', 'a1', 'a1', 'a2'],
                        'key3':['b1', 'b2', 'b1', 'b2', 'b1', 'b2'],
                        'key4':['c1', 'c2', 'c3', 'c1', 'c2', 'c3'],
                        'values': [1, 2, 3, 4, 5, 6]})
df

  key1 key2 key3 key4  values
0   KO   a1   b1   c1       1
1   KO   a1   b2   c2       2
2   KO   a2   b1   c3       3
3   US   a1   b2   c1       4
4   US   a1   b1   c2       5
5   US   a2   b2   c3       6

In [20]:
# df.pivot(index='key1', columns='key2', values='values')
#> ValueError: 인덱스 중복.

df.pivot(index='key1', columns=['key2', 'key3'], values='values')

key2   a1        a2
key3   b1   b2   b1   b2
key1
KO    1.0  2.0  3.0  NaN
US    5.0  4.0  NaN  6.0

In [21]:
df.pivot(index='key1', columns=['key3', 'key4'], values='values')

key3   b1   b2   b1   b2   b1   b2
key4   c1   c2   c3   c1   c2   c3
key1
KO    1.0  2.0  3.0  NaN  NaN  NaN
US    NaN  NaN  NaN  4.0  5.0  6.0

In [22]:
df.pivot(index=['key1', 'key2'], columns='key3', values='values')

key3        b1   b2
key1 key2
KO   a1    1.0  2.0
     a2    3.0  NaN
US   a1    5.0  4.0
     a2    NaN  6.0